stsepelin/zeppl/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partitions
CONFIG_PARTITION_TABLE_CUSTOM=y

# PSRAM + L2 cache (needed for 800x800 framebuffer + LVGL working memory)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compiler / runtime
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# 33 ms (~30 FPS) targets a render budget the SW renderer reliably fits
# on this BSP with ESP-Hosted's SDIO traffic active. 15 ms (66 FPS) used
# to race the budget and end up at ~25 FPS with visible chop during
# heavy renders. See tach_arc.c for the matching baked-sprite refactor.
CONFIG_LV_DEF_REFR_PERIOD=33
CONFIG_LV_OS_FREERTOS=y
# One SW draw unit, not two: each draw thread reserves a 32 KB INTERNAL-RAM
# stack (FreeType needs >=32 KB), and internal RAM is the binding constraint on
# this board — BLE/esp-hosted + LVGL leave only ~6 KB free at runtime, which
# OOM-crashed task creation. With the baked-sprite render at ~5 ms, single-
# threaded drawing still clears the 33 ms / 30 FPS budget. Frees ~32 KB.
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1

# Boot animation: GIF (LZW + bitmap blit — cheap on the P4). Vector / Lottie
# was dropped because ThorVG rasterization at 800×800 wasn't real-time on
# this MCU. The bundled AnimatedGIF decoder caps width at 480 px by default;
# we patch MAX_WIDTH up to 800 to match the panel width.
CONFIG_LV_USE_GIF=y

# PPA hardware accelerator was tried for the cooked-GIF blit but causes
# horizontal banding on this BSP's DSI tear-avoid triple-buffer setup, so
# it's off. Re-enable only with a known-good buffer alignment story.
# CONFIG_LV_USE_PPA is not set

# Pin pthreads to core 1 so any LVGL draw worker stays off the sim core.
CONFIG_PTHREAD_DEFAULT_CORE_1=y
CONFIG_PTHREAD_TASK_CORE_DEFAULT=1
# IRAM-placement of LVGL fast-mem functions is replaced by a stable section
# override in main/CMakeLists.txt (GCC 15 rejects IRAM_ATTR's __COUNTER__).
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set

# All UI text uses JetBrains Mono Bold compiled in as custom .c files
# (see main/display/fonts). Only Montserrat 14 stays enabled because
# LVGL's Kconfig forces SOME built-in font as the default — the bigger
# Montserrat sizes used to be there for the boot-screen text fallback,
# which now reuses JBM Bold.
CONFIG_LV_FONT_MONTSERRAT_14=y

# FreeType runtime font rendering — used for the emoji fallback chain.
# The lv_font_conv pipeline can only bake mono bitmaps for a fixed
# codepoint range, so emoji land here as a runtime fallback set on
# jbm_bold_*.fallback. We ship a monochrome emoji font (Noto Emoji
# wght.ttf) — color emoji formats (COLR v1, Twemoji COLR v0) were both
# tried and rendered invisibly because LVGL's freetype glyph-dsc step
# calls FT_LOAD_COMPUTE_METRICS without FT_LOAD_COLOR, which on glyf-
# empty COLR fonts returns width=0/height=0 and the label allocates a
# zero-sized slot. Mono fonts have real outlines, so metrics work.
#
# LV_USE_FS_MEMFS lets us hand the FreeType create_font path an in-memory
# buffer wrapped in lv_fs_path_ex_t instead of a real filesystem path —
# the TTF is embedded via EMBED_FILES so it lives in flash, not on SD.
# 'M' = 0x4D is the drive letter the docs suggest.
CONFIG_LV_USE_FREETYPE=y
CONFIG_LV_FREETYPE_USE_LVGL_PORT=y
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FREETYPE=y
CONFIG_LV_USE_FS_MEMFS=y
CONFIG_LV_FS_MEMFS_LETTER=77
# FreeType is stack-hungry on first glyph load — LVGL refuses to compile
# unless the draw-thread stack is at least 32 KB.
CONFIG_LV_DRAW_THREAD_STACK_SIZE=32768
# Glyph cache ceiling. Default (256) would let the emoji cache balloon to
# ~700 KB PSRAM with ARGB8888 32×32 glyphs. Realistic working set on the
# cluster is <30 distinct emoji at a time; cap to 64 so the cache stays
# under ~170 KB and evicts long-tail glyphs sooner.
CONFIG_LV_FREETYPE_CACHE_FT_GLYPH_CNT=64

# IDF v6 experimental features (BSP needs DSI etc.)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- BLE peripheral via esp_hosted VHCI on co-proc ESP32-C6 ---
# The cluster has no native BT controller; the ESP32-C6 module on the
# Waveshare board acts as the BLE coprocessor and we host the NimBLE host
# stack here, talking to it over SDIO (esp_hosted) using the VHCI transport.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# CONFIG_BT_NIMBLE_TRANSPORT_UART is not set
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y

# Security manager — LE Secure Connections + numeric-comparison passkey.
# SM_LEGACY off so we can't fall back to the older (weaker) pairing flow.
# SM_SC needs the C6 controller side to advertise SC support too, which
# the esp_hosted bundle does by default. Bonds persist in NVS via
# BT_NIMBLE_NVS_PERSIST above.
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y

# CONFIG_LV_USE_SYSMON is not set
# CONFIG_LV_USE_PERF_MONITOR is not set

# LVGL log level: ERROR only. INFO level routes per-draw/layer/flex traces
# through printf to the 115200 UART console; a burst of those (dozens of
# lines per frame whenever a transformed widget redraws) takes >300 ms to
# drain at that baud and blocks the LVGL render thread the whole time —
# producing periodic freezes to ~4 FPS. ERROR keeps panic/error diagnostics
# without the per-frame spam.
CONFIG_LV_LOG_LEVEL_ERROR=y

# Drop the vendor-specific spi_flash chip-driver registration so
# winbond / mxic / issi / boya / th don't compete with the generic driver
# for IRAM placement on P4 < v3 silicon under
# -Wl,--enable-non-contiguous-regions. main.c provides the cut-down
# default_registered_chips[] containing just the generic driver.
# See docs/ble-bringup-bisect.md for the full story.
CONFIG_SPI_FLASH_OVERRIDE_CHIP_DRIVER_LIST=y
